app/Controllers/Admin/Auth.php

SELECT *
FROM `admin`
WHERE `username` = 'Perkim'
 LIMIT 1
SELECT *
FROM `dinas`
WHERE `username` = 'Perkim'
 LIMIT 1
---
    public function processLogin()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $adminModel = new AdminModel();
        $dinasModel = new DinasModel();

        // Admin
        $admin = $adminModel->where('username', $username)->first();
        if ($admin && password_verify($password, $admin['password'])) {
            session()->set([
                'role' => 'admin',
                'user' => $admin
            ]);
            return redirect()->to('/admin/dashboard');
        }

        // Dinas
        $dinas = $dinasModel->where('username', $username)->first();

SELECT *
FROM `admin`
WHERE `email` = 'dickyabdilah27@gmail.com'
 LIMIT 1
SELECT *
FROM `dinas`
WHERE `email` = 'dickyabdilah27@gmail.com'
 LIMIT 1
UPDATE `admin` SET `reset_token` = 'b63e7f32c9230665e7bbc16bbaf3696cba6d4c802c6dc10b4a23958df3a9415b'
WHERE `admin`.`id` IN ('1')
UPDATE `dinas` SET `reset_token` = 'cae30b407c048ffe3017e84afcf23e43ed4ca1398fa089236e102abb3b69d3c1'
WHERE `dinas`.`id` IN ('3')
---
    public function processForgotPassword()
    {
        $email = $this->request->getPost('email');

        $adminModel = new AdminModel();
        $dinasModel = new DinasModel();

        $user = $adminModel->where('email', $email)->first();
        $role = 'admin';

        if (!$user) {
            $user = $dinasModel->where('email', $email)->first();
            $role = 'dinas';
        }

        if (!$user) {
            return redirect()->back()->with('error', 'Email tidak ditemukan.');
        }

        // Buat token unik
        $token = bin2hex(random_bytes(32));

        // Simpan token ke DB
        if ($role === 'admin') {
            $adminModel->update($user['id'], ['reset_token' => $token]);
        } else {
            $dinasModel->update($user['id'], ['reset_token' => $token]);

SELECT *
FROM `admin`
WHERE `reset_token` = 'df05c5051b307cc04231df49890416f5d17f33548528b32f2e5c896acb55c1bd'
 LIMIT 1
---
    public function processResetPassword()
    {
        $token = $this->request->getPost('token');
        $newPass = $this->request->getPost('password');
        $confirmPass = $this->request->getPost('confirm_password');

        if (!$token) {
            return redirect()->to('/forgot-password')->with('error', 'Token tidak valid atau sudah digunakan.');
        }
        if (strlen($newPass) < 6) {
            return redirect()->back()->with('error', 'Password minimal 6 karakter.');
        }
        if ($newPass !== $confirmPass) {
            return redirect()->back()->with('error', 'Konfirmasi password tidak sama!');

        }

        $adminModel = new AdminModel();
        $dinasModel = new DinasModel();

        $user = $adminModel->where('reset_token', $token)->first();

UPDATE `admin` SET `password` = '$2y$10$DcuEQNqivLXpTMHdpE7WyOPhzeJrOEh7QsZ8L2bPJ7wssS5f82w8i', `reset_token` = NULL
WHERE `admin`.`id` IN ('1')
---
        $hashed = password_hash($newPass, PASSWORD_DEFAULT);

        if ($role === 'admin') {
            $adminModel->update($user['id'], ['password' => $hashed, 'reset_token' => null]);