app/Controllers/Admin/DataAkunDinas.php

    public function index()
    {
        $data['dinas'] = $this->dinasModel->findAll();
---
SELECT *
FROM `dinas`