app/Controllers/Admin/PengajuanDetail.php

SELECT `p`.*, `d`.`nama_dinas`
FROM `pengajuan` as `p`
LEFT JOIN `dinas` as `d` ON `d`.`id` = `p`.`dinas_id`
WHERE `p`.`id` = '34'
SELECT *
FROM `dokumen_user`
WHERE `pengajuan_id` = '34'
---
    public function index($id)
    {
        $builder = $this->db->table('pengajuan as p');
        $builder->select('p.*, d.nama_dinas');
        $builder->join('dinas as d', 'd.id = p.dinas_id', 'left');
        $builder->where('p.id', $id);

        $data['pengajuan'] = $builder->get()->getRowArray();

        if (!$data['pengajuan']) {
            return redirect()->to(base_url('admin/pengajuanDaftar'))
                ->with('error', 'Pengajuan tidak ditemukan');
        }

        $data['dokumen'] = $this->db->table('dokumen_user')
            ->where('pengajuan_id', $id)
            ->get()
            ->getResultArray();