app/Controllers/Admin/PengajuanKelola.php

    public function index()
    {
        $builder = $this->db->table('pengajuan as p');
        $builder->select('p.id, p.nip, p.nama_pegawai, p.golongan, p.jabatan, p.tanggal_lahir, p.jenis, p.status, p.created_at, d.nama_dinas');
        $builder->join('dinas as d', 'd.id = p.dinas_id', 'left');

        $data['pengajuan'] = $builder->orderBy('p.created_at', 'DESC')->get()->getResultArray();
        $data['dinasList'] = $this->db->table('dinas')->orderBy('nama_dinas', 'ASC')->get()->getResultArray();
---
SELECT `p`.`id`, `p`.`nip`, `p`.`nama_pegawai`, `p`.`golongan`, `p`.`jabatan`, `p`.`tanggal_lahir`, `p`.`jenis`, `p`.`status`, `p`.`created_at`, `d`.`nama_dinas`
FROM `pengajuan` as `p`
LEFT JOIN `dinas` as `d` ON `d`.`id` = `p`.`dinas_id`
ORDER BY `p`.`created_at` DESC
SELECT *
FROM `dinas`
ORDER BY `nama_dinas` ASC

    public function updateStatus($id, $status)
    {
        $dataUpdate = ['status' => $status];

        // Ambil alasan penolakan
        $alasan = $this->request->getVar('alasan_penolakan') ?? $this->request->getVar('alasan_ditolak');
        if ($status === 'Ditolak') {
            $dataUpdate['alasan_penolakan'] = $alasan ?: 'Tidak ada alasan yang diberikan';
        }

        $this->db->table('pengajuan')->where('id', $id)->update($dataUpdate);
---
UPDATE `pengajuan` SET `status` = 'Disetujui'
WHERE `id` = '34'