app/Controllers/Admin/Profil.php

    public function index()
    {
        $user = session()->get('user');

        // Cek login
        if (!$user || !isset($user['id'])) {
            return redirect()->to('/admin/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        $admin = $this->adminModel->find($user['id']);
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = '1'

    public function edit()
    {
        $user = session()->get('user');

        // Cek login
        if (!$user || !isset($user['id'])) {
            return redirect()->to('/admin/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        $admin = $this->adminModel->find($user['id']);
---
SELECT *
FROM `admin`
WHERE `admin`.`id` = '1'