app/Controllers/Dinas/Dashboard.php

    public function index()
    {
        // Pastikan yang login adalah dinas
        if (session()->get('role') !== 'dinas') {
            return redirect()->to('/login');
        }

        $dinas = session()->get('user'); // data dinas dari session
        $pengajuanModel = new PengajuanModel();

        // Total pengajuan yang diajukan dinas ini
        $totalPengajuan = $pengajuanModel
            ->where('dinas_id', $dinas['id'])
            ->countAllResults();

        // Ambil pengajuan terakhir milik dinas
        $lastPengajuan = $pengajuanModel
            ->where('dinas_id', $dinas['id'])
            ->orderBy('updated_at', 'DESC')
            ->orderBy('created_at', 'DESC')
            ->first();
---
SELECT COUNT(*) AS `numrows`
FROM `pengajuan`
WHERE `dinas_id` = '3'
SELECT *
FROM `pengajuan`
WHERE `dinas_id` = '3'
ORDER BY `updated_at` DESC, `created_at` DESC
 LIMIT 1