app/Controllers/Dinas/LihatPengajuan.php

SELECT `pengajuan`.*, `dinas`.`nama_dinas`
FROM `pengajuan`
LEFT JOIN `dinas` ON `dinas`.`id` = `pengajuan`.`dinas_id`
WHERE `pengajuan`.`dinas_id` = '6'
ORDER BY `pengajuan`.`created_at` DESC
---
    public function lihat_pengajuan()
    {
        if (session()->get('role') !== 'dinas') {
            return redirect()->to('/login');
        }

        $pengajuanModel = new PengajuanModel();
        $dinas = session()->get('user');

        $pengajuan = $pengajuanModel
            ->select('pengajuan.*, dinas.nama_dinas')
            ->join('dinas', 'dinas.id = pengajuan.dinas_id', 'left')
            ->where('pengajuan.dinas_id', $dinas['id'])
            ->orderBy('pengajuan.created_at', 'DESC')
            ->findAll();